---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.CouldNotChangeTypeOfAssembly
source: html/e5fdc2bb-dfad-445d-7787-2ac05f90988d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.CouldNotChangeTypeOfAssembly Property

Assembly cannot be changed to selected type.

## Syntax (C#)
```csharp
public static FailureDefinitionId CouldNotChangeTypeOfAssembly { get; }
```